{
    "project_sets": [{
        "id": "projects",
        "name": "Projects",
        "set": [{
            "id": "my_website",
            "name": "This Website",
            "image": "images/dan1.jpg",
            "description": "You're looking at it!  I created this with <strong>Bootstrap</strong> for the layout and <strong>Nunjucks</strong> for templating.  I avoided Yeoman this time because I wanted to really get my hands dirty with creating the stuff Yeoman takes care of for you, like the <strong>Gulp</strong> flow.  Plus I knew it would be a very simple site.  Go ahead and peruse the <a href=\"http://www.github.com/dscush/dancusher\">source code</a>."
        },{
            "id": "rcpg_module",
            "name": "Random Music",
            "image": "images/fifths.gif",
            "description": "This is a <strong>Python module</strong> I'm working on to randomly generate musical chord progressions based on a given probability mass function (PMF).  I certainly wouldn't call it AI or Artificial Creativity, but I'm hoping it might serve as a fun tool to aid musicians in accessing their own creativity.  It's very early in development and it's only available so far as a module, but if you know basic Python you should be able to figure it out from the <a href=\"http://www.github.com/dscush/rcpg\">source code</a>, or just install it from <strong>PyPI</strong> with <code>pip install rcpg</code>.  I'm currently working on wrapping it in a <a href=\"http://www.github.com/dscush/rcpg-flask\">web app</a> to allow non-technical end users to enter their own PMFs.  This is my first time creating something from the beginning using <strong>test driven development</strong>.  The idea was inspired by <a href=\"https://www.youtube.com/watch?v=N7a1Ua6kvcA\">Langorhythm</a>"
        },{
            "id": "friends_website",
            "name": "Friends Website",
            "image": "images/friends_site.jpg",
            "description": "I originally made this <strong>Django</strong> app primarily to store the membership list for the Friends of the Grafton Public Library.  When I became Membership Chair in 2015, I was given a single over-complicated Excel sheet with rows organized by both individual and family.  First I split that out into a relational database (a table for individuals and a table for families), but when I realized that eventually there would be a new Membership Chair who didn't know <strong>SQL</strong>, I decided to wrap it in Django's beautiful built-in admin app.  Then I decided the Friends could use a <a href=\"http://www.friendsgpl.org\">public website</a>, instead of the single page we had on the library's site, so I built that as well.  It reaches into the DB for the board/committee data to display it on the About page.  I plan to build out a login system for members to check their membership status and renew their dues online - probably via PayPal, but I may decide to integrate with <strong>Stripe</strong>, which I've used a little bit for work.  See <a href=\"http://www.github.com/dscush/friendsgpl\">source</a>."
        },{
            "id": "mancala",
            "name": "Mancala AI",
            "image": "images/mancala.jpg",
            "description": "This is a simple mancala web app.  It's all front end - the logic is purely client <strong>JavaScript</strong>.  The cool part is the <strong>artificial intelligence</strong> algorithm that plays against you.  It uses a <strong>minimax</strong> algorithm with <strong>alpha-beta pruning</strong> to allow deeper searching within a reasonable time.  I used the <strong>model view controller</strong> pattern, as well as JavaScript object constructors and prototype manipulation, to demonstrate my skill with JavaScript's <strong>prototypal inheritance</strong>. I used <strong>jQuery</strong> to link the <strong>MVC</strong>'s controller and view.  See <a href=\"http://www.github.com/dscush/mancala\">source</a>."
        }]
    }, {
        "id": "extracurriculars",
        "name": "Extracurriculars",
        "set": [{
            "id": "friends_group",
            "name": "The Library",
            "image": "images/logo_no_words.gif",
            "description": "I've served on the board of directors for <a href=\"http://www.friendsgpl.org\"> The Friends of the Grafton Public Library</a> since June 2015, first as the Membership Chair, and now as President.  I've managed the membership list and created our website (listed under the project section), sent mass emails via Constant Contact and MailChimp, organized fundraisers, solicited donations, led meetings, and achieved consensus among the board on controversial issues.  My biggest accomplishment so far is leading a political campaign for a $16.6 million library expansion project.  Due to complex local politics, it was a lot more controversial than you'd expect; the same effort lost in a massive 63%-to-37% landside in 2011, but we managed to win in 2017 with 56% over 44%."
        },{
            "id": "music",
            "name": "Music",
            "image": "images/BWV847_page2.gif",
            "description": "Ever since I started piano lessons in second grade, music has been an important part of my life - much less important in recent years, but it's still there.  More than anything, I'm interested in music theory, but I also play piano and guitar, sing bass, and have dabbled in flute, fife, tin whistle, recorder, ocarina, and djembe."
        },{
            "id": "science",
            "name": "Science",
            "image": "images/growthplate.jpg",
            "description": "Before becoming a software engineer, I majored in psychology, minored in biology, and did the pre-med track.  After deciding not to go to med school and before getting my MS in Computer Science, I worked for four years as a biomed lab tech in a behavioral neuroendocrinology lab and an orthopedics lab (where I created the image above).  You can take a look at <a href=\"http://www.ncbi.nlm.nih.gov/pubmed?term=cusher%5BAuthor%5D\">my pubications on PubMed</a>.  I'm particularly interested in psychology, neuroscience, and evolution."
        }]
    }]
}
