{
    "project_sets": [{
        "id": "projects",
        "name": "Projects",
        "set": [{
            "id": "friends_website",
            "name": "Friends Website",
            "image": "images/friends_site2.jpg",
            "description": "This is an <strong>single-page</strong> app I made for a local nonprofit.  I started it all off with <strong>Yeoman</strong>, then <strong>Bootstrap</strong> and <strong>AngularJS</strong>, as well as <strong>Sass</strong>, <strong>Gulp</strong>, Babel, Bower, and bunch of other fancy buzzwords.  Go ahead and <a href=\"http://www.friendsgpl.org\">check it out</a> for yourself, or dig into the <a href=\"http://www.github.com/dscush/friends-public\">source code</a>.  I especially like how various links, especially on the About page, send you to the Contact page with the form partially prepopulated for you.  That took a while, but I learned <i>a lot</i> about Angular UI-Router."
        },{
            "id": "my_website",
            "name": "This Website",
            "image": "images/dan2.jpg",
            "description": "You're looking at it!  I created this with <strong>Bootstrap</strong> for the layout and <strong>Nunjucks</strong> for templating.  I avoided Yeoman this time because I wanted to really get my hands dirty with creating the stuff Yeoman takes care of for you, like the <strong>Gulp</strong> flow.  Go ahead and peruse the <a href=\"http://www.github.com/dscush/dancusher\">source code</a>."
        },{
            "id": "friends_database",
            "name": "Friends Database",
            "image": "images/friends_database.jpg",
            "description": "I made this <strong>Django</strong> app primarily to store the membership list for the Friends of the Grafton Public Library.  When I became Membership Chair, I was given a single over-complicated Excel sheet with rows organized by both individual and family.  First I split that out into a relational database (a table for individuals and a table for families), but when I realized that eventually there would be a new Membership Chair who didn't know <strong>SQL</strong>, I decided to wrap it in Django's beautiful built-in admin app.  I plan to incorporate this into the main Friends site as a backend, so that I can A) store other site data there and B) allow board members to login and view the membership info via that same site.  See <a href=\"http://www.github.com/dscush/friendsgpl\">source</a>."
        }]
    }, {
        "id": "extracurriculars",
        "name": "Extracurriculars",
        "set": [{
            "id": "friends_group",
            "name": "The Library",
            "image": "images/logo_no_words.png",
            "description": "I've served on the board of directors for <a href=\"http://www.friendsgpl.org\"> The Friends of the Grafton Public Library</a> since June 2015, first as the Membership Chair, and now as President.  I've managed the membership list (in the django app listed under the project section), sent mass emails via Constant Contact, created a website (also under the project section), organized fundraisers, solicited donations, led meetings, and achieved consensus among the board on controversial issues."
        },{
            "id": "music",
            "name": "Music",
            "image": "images/ii-aug6-i64-V.gif",
            "description": "Ever since I started piano lessons in second grad, music has been an important part of my life - much less important in recent years, but it's still there.  More than anything, I'm interested in music theory - but I also play piano and guitar, sing bass, and have dabbled in a flute, fife, tin whistle, recorder, ocarina, and djembe."
        },{
            "id": "science",
            "name": "Science",
            "image": "images/growthplate.jpg",
            "description": "Long before becoming a software engineer, I majored in psychology, minored in biology, and did the pre-med track.  After deciding not to go to med school and before getting my MS in Computer Science, I worked for four years as a biomed lab tech in a behavioral neuroendocrinology lab and an orthopedics lab (where I created the image above).  You can take a look at <a href=\"http://www.ncbi.nlm.nih.gov/pubmed?term=cusher%5BAuthor%5D\">my pubications</a>.  I'm particularly interested in psychology, neuroscience, and evolution."
        }]
    }]
}
    